---
kind: type
id: T:Autodesk.Revit.DB.PanelTypeSet
source: html/3ca7bd7c-d7fd-64a7-da94-139d768d871d.htm
---
# Autodesk.Revit.DB.PanelTypeSet

A set that contains panel types.

## Syntax (C#)
```csharp
public class PanelTypeSet : APIObject,
	IEnumerable
```